<?php
// Heading
$_['heading_title']				= 'Клубная программа (Подарки)';

// Text
$_['text_total']				= 'Учитывать в заказе';
$_['text_success']				= 'Настройки успешно изменены!';
$_['text_edit']					= 'Настройки';

// Entry
$_['entry_status']				= 'Статус';
$_['entry_sort_order']			= 'Порядок сортировки';

// Help
$_['help_status']				= 'Включить/выключить учет в заказе';
$_['help_sort_order']			= 'Порядок сортировки при учете в заказе';

// Error
$_['error_permission']			= 'У Вас нет прав для управления данным модулем!';