<?php
// Heading
$_['heading_title']				= 'Клубная программа (Клубная карта)';

// Text
$_['text_total']				= 'Учитывать в заказе';
$_['text_success']				= 'Настройки успешно изменены!';
$_['text_edit']					= 'Настройки';

// Entry
$_['entry_status']				= 'Статус';
$_['entry_sort_order']			= 'Порядок сортировки';
$_['entry_use_with_coupon']		= 'Совместное использование с купонами';
$_['entry_use_with_voucher']	= 'Совместное использование с ваучерами';

// Help
$_['help_status']				= 'Включить/выключить учет в заказе';
$_['help_sort_order']			= 'Порядок сортировки при учете в заказе';
$_['help_use_with_coupon']		= 'Если включить, то клубная карта будет действовать совместно с купоном';
$_['help_use_with_voucher']		= 'Если включить, то клубная карта будет действовать совместно с подарочным сертификатом';

// Error
$_['error_permission']			= 'У Вас нет прав для управления данным модулем!';