<?php
// Heading
$_['heading_title']        = 'Регистрация';

// Text
$_['text_account']         = 'Личный Кабинет';
$_['text_register']        = 'Регистрация';
$_['text_account_already'] = 'Если Вы уже зарегистрированы, перейдите на страницу <a href="%s">авторизации</a>.';
$_['text_your_details']    = 'Основные данные';
$_['text_newsletter']      = 'Рассылка новостей';
$_['text_your_password']   = 'Ваш пароль';
$_['text_agree']           = 'Нажимая кнопку <span>Зарегистрироваться</span>, вы соглашаетесь с <a href="%s">%s</a> и <a href="%s">%s</a>';

// Entry
$_['entry_customer_group'] = 'Направление бизнеса';
$_['entry_firstname']      = 'Имя';
$_['entry_lastname']       = 'Фамилия';
$_['entry_email']          = 'E-Mail';
$_['entry_telephone']      = 'Телефон';
$_['entry_newsletter']     = 'Подписка на рассылку и новости';
$_['entry_newsletdes']     = 'Вы будете получать самые актуальные новости о нашем интернет-магазине, скидки, купоны, чеки, информацию по заказам, действая по клубной карте и др..';
$_['entry_password']       = 'Пароль';
$_['entry_confirm']        = 'Подтверждение пароля';

// Error
$_['error_exists']         = 'Данный E-Mail уже зарегистрирован!';
$_['error_firstname']      = 'Имя должно быть от 1 до 32 символов!';
$_['error_lastname']       = 'Фамилия должна быть от 1 до 32 символов!';
$_['error_email']          = 'E-Mail введен неправильно!';
$_['error_telephone']      = 'Телефон должен быть от 3 до 32 цифр!';
$_['error_custom_field']   = '%s обязательно к заполнению!';
$_['error_password']       = 'В пароле должно быть от 4 до 20 символов!';
$_['error_confirm']        = 'Пароли и пароль подтверждения не совпадают!';
$_['error_agree']          = 'Вы должны прочитать и согласится с %s!';

