<?php 

$_['heading_title']     = 'Обновление остатков';
$_['heading_title_tow'] = 'Обновление остатков в магазине';

$_['text_pr_settings']      = 'Настройки прайс-листа';
$_['text_pars_col']         = 'Колонки парсинга';
$_['text_sku_col']          = 'Номер колонки <strong>"Артикул"</strong>';
$_['text_upc_col']			= 'Номер колонки <strong>"UPC"</strong>';
$_['text_price_col']        = 'Номер колонки <strong>"Цена"</strong>';
$_['text_quant_col']        = 'Номер колонкиа <strong>"Количество"</strong>';
$_['text_z_pars']			= 'Диапазон парсинга';
$_['text_z_start']			= 'Первая колонка';
$_['text_z_stop']           = 'Последняя колонка';
$_['text_upl']				= 'Обновление остатков';
$_['text_upl_start']        = 'Обновить остатки';
$_['text_upd']              = 'Загрузка прaйс-листа';
$_['text_upd_statr']        = 'Обновление';
$_['text_dwl']				= 'Выгрузка товара с магазина';
$_['text_dwl_param']		= 'Параметры выгрузки';
$_['text_manuf']			= 'Производитель';
$_['text_all']				= 'Все';
$_['text_categ']			= 'Категория';
$_['text_sort']				= 'Сортировать прайс-лист';
$_['text_s_item']			= 'Сортировать по полю';
$_['text_s_name']			= 'Название товара';
$_['text_s_model']			= 'Модель';
$_['text_s_q']				= 'Количество';
$_['text_s_pr']				= 'Цена';
$_['text_order']			= 'Порядок сортировки';
$_['text_asc']				= 'По возростанию';
$_['text_desc']				= 'По убыванию';


$_['column_sku'] 		  	= 'Артикул';	
$_['column_upc'] 		  	= 'UPC';	
$_['column_name'] 		  	= 'Название товара';	
$_['column_quantity'] 	  	= 'Количество';		
$_['column_price'] 		  	= 'Цена';	
$_['column_stock_status'] 	= 'Статус товара в магазине';			
$_['column_category'] 	  	= 'Категория';		
$_['column_manufacturer'] 	= 'Производитель';			
$_['column_model'] 		  	= 'Модель';
$_['column_show_store']     = 'В магазине';
$_['column_status']			= 'Статус обновления';

$_['text_module']           = 'Дополнения';
$_['text_sheet']            = 'Лист остатков';
$_['text_show']             = 'Отображается';
$_['text_hide']             = 'Не отображается';
$_['text_price_name']       = 'Выгрузка остатков за - ';	

$_['error_filetype']        = 'Недопустимый тип прайс-листа!';
$_['error_upload']          = 'Прайс-лист не загружен!';
$_['error_sku']				= 'Поле "Артикул" должно быть заполнено! Введите 0 если не используете это поле';
$_['error_upc']				= 'Поле "UPC" должно быть заполнено! Введите 0 если не используете это поле';
$_['error_name']			= 'Поле "Название" должно быть заполнено!';
$_['error_price']			= 'Поле "Цена" должно быть заполнено! Введите 0 если не используете это поле';
$_['error_quantity']		= 'Поле "Количество" должно быть заполнено! Введите 0 если не используете это поле';
$_['error_start_column']	= 'Поле "Первая колонка" должно быть заполнено!';
$_['error_stop_column']		= 'Поле "Последняя колонка" должно быть заполнено!';
$_['error_upc_sku']         = 'Поле Артикул или UPC должно быть больше 0'; 
$_['error_quantity_price']  = 'Поле Прайс или Количество должно быть больше 0';

$_['error_permission']      = 'У Вас нет прав для управления модулем!';

$_['text_success'] = 'Настройки прайс-листа успешно сохранены!';

//AJAX
$_['duble_item'] = 'Повторяющейся товар';
$_['no_sku_and_upc'] = 'Нет Артикуля и UPC';
$_['no_price_quantity'] = 'Нет цены и количества';
$_['good'] = 'Товар успешно обновлен';
$_['not_found'] = 'Товар не найден в базе';
$_['in_store'] = '<strong> В магазине: </strong> ';