<?php
// Heading
$_['heading_title'] 			= '&laquo;Клубная программа&raquo; - Клубная карта';

// Text
$_['button_card_applying']		= 'Применить карту';
$_['button_card_request']		= 'Получить карту';

// Text
$_['text_card']   				= 'Клубная карта (%s)';
$_['text_success_applied']  	= 'Клубная карта успешно применена';
$_['text_success_card_request'] = 'Запрос на получение карты отправлен';
$_['text_current_discount'] 	= 'Текущая скидка клубной карты %s';
$_['text_mail_subject']       	= '%s - Клубная программа. Смена баланса клубной карты';

// Entry
$_['entry_card']				= 'Клубная карта';
$_['entry_card_request']		= 'Вы можете получить клубную карту';

// Error
$_['error_membership']			= 'Ошибка: клубная программа не доступна';
$_['error_card']				= 'Ошибка: неправильный код клубной карты или отключена возможность использования';
$_['error_card_empty']			= 'Ошибка: введите код клубной карты';
$_['error_card_request']		= 'Ошибка: не удалось получить клубную карту';